testing/app/controllers/api/v1/photo_infos_controller.rb

  def create
    @photo_info = PhotoInfo.create(photo_info_params)
---
INSERT INTO "photo_infos" ("age", "beauty", "emotion", "ethnicity", "gender", "skinstatus", "smile", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"

  def update
    @photo = PhotoInfo.find(params[:id])
    @photo.update(note:params[:photo_info][:note])
---
SELECT  "photo_infos".* FROM "photo_infos" WHERE "photo_infos"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
UPDATE "photo_infos" SET "note" = $1, "updated_at" = $2 WHERE "photo_infos"."id" = $3  [["note", "\"Hello this is a note I wrote for this picture\""], ["updated_at", "2018-10-16 13:38:46.522792"], ["id", 7]]