testing/app/controllers/api/v1/users_controller.rb

  def find_all_photos
    @user = User.find(user_id_params[:user_id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]